app/Controllers/AdminController.php

			public function index()
			{
				$data['users'] = $this->user->findAll();
---
SELECT *
FROM `user`

			public function edit($id)
			{
				$data = $this->request->getPost();
				if($data){
					if($data){
						if($data['rolekey']==false){
							$dataForm =[
								'status' => $this -> request -> getPost('status')
							];
						}else{
							$dataForm =[
								'role' => $this -> request -> getPost('role'),
								'email' => $this -> request -> getPost('email')
							];
						}
					}
					$this->user->update($id, $dataForm);
---
UPDATE `user` SET `status` = '1'
WHERE `user`.`id` IN ('13')