app/Controllers/AuthController.php

		public function login()
		{
		if ($this->request->getPost()) {
			$username = $this->request->getVar('username');
			$password = $this->request->getVar('password');
			$dataUser = $this->user->where(['username' => $username])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'sayarefal'
 LIMIT 1

			public function register()
			{
				if ($this->request->getPost()) {
					$username = $this->request->getVar('username');
					$password = md5($this->request->getVar('password'));
					$email = $this->request->getVar('email');
					$data = [
						'username' => $username,
						'password' => $password,
						'email' => $email
					];
					$this->user->insert($data);
---
INSERT INTO `user` (`username`, `password`, `email`) VALUES ('sayarefal', 'ad3437b2fd96029cdd25860c606ec5d7', 'reifalbukananakkecil@gmail.com')